interface Novel {
  author: string
  identifyText: string
  value: string
}

export const miiNovels: Novel[] = [
  {
    author: '匿名',
    identifyText: '1作目',
    value: `ねこはねこ。決まったお家はないの。そういうの、野良って言うんだって。あの二本足のやつは人っていう。人がねこのこと野良って呼ぶの。人って勝手。

おひさまが出てきたら、暖かくなるって知ってる？ねこは知ってる。だからね、おひさまがぽかぽかな場所を探して歩くの。

人が出てきて餌をくれるの。でも「お家には連れてけないの」って変な顔。それでどっか行っちゃう。へんなの。人ってやっぱり勝手だね。

お気に入りはこの家の屋根。人がフラフラ出かけてく。どこ行くんだろ。知らない。ねこもフラフラ出かけちゃう。ねこはどこへ行こうかな。知らない。どこだって楽しいもん。

お月様が出てくると寒くなるからねこはやだ。でもご飯がよく見えるから、いいことだってあるんだよ。公園ってとこで声を出す。歌うって楽しいの。

なんだか人が近づいてくる。なんかを言って、変な顔。勝手にねこを撫でるの。やっぱり人って勝手だな。ねこはだんだん眠くなる。このまま寝ちゃおう。

人もねこなら、変な顔しないでいいのにね。ねこっていいでしょ、ねえ。
`,
  },
  {
    author: '望月よもぎ',
    identifyText: '2作目',
    value: `絶望の闇が覆う午前二時。
僕を置いて遠くへ消えてしまったのだろうか。
すべてはじめから嘘だったと、言ってくれる人はいないのだろうか。

朝は苦手な方ではなかった。
しかし、彼女がこの家に住むようになってから朝が嫌いになった。
彼女が作る朝食が不味いというわけではない。
この匂いは卵料理だな…


同棲を始めて半年。
最初の頃はまだ彼女の精神も安定していて、まともな生活ができていた。
僕が料理を作るよと言ったが、彼女は「ご飯だけでも作らせて。」
と言い、話しを聞いてはくれなかった。

卵料理にはあまりいい思い出はなく、起き上がるのに時間がかかった。
食卓に並べられたオムレツは、見た目は比較的綺麗な方だった。
恐る恐る口に運んだが、塩辛すぎる。
こういう時、先生はやんわりとした形ででも意見を言うべきだと言っていた。
少々傷つけることになってもこればっかりは仕方ない。

「もう少し甘いほうが好みだったんだけど、忘れちゃった？」

そういった後、彼女はあからさまに悲しい顔をしていた。
僕だってこんなこと言いたくはない。
でも仕方がないと、自分の心に言い聞かせた。

仕事の日は、毎朝彼女が朝食も夕食も作っているが、台所にも立たせたくない。
お互い休暇の日には、少し彼女の精神が安定するので映画鑑賞をしたりゲームをしたり、恋人らしいことをしていた。


朝食を取った後すぐ支度をし、先生との待合場所であるカフェに行く。先生は先に着いていて申し訳なく感じた。

「遅くなりすみません。本日もよろしくお願いします。」
僕の一言で今日のカウンセリングも始まった。


僕と彼女は大学のサークルで知り合った。
僕は可愛い子だなとは思っていたが、彼女は僕のことを結構前から好きだったらしく卒業の日に告白された。
ほかに好意を持った人がいなかった僕は承諾した。それが最初の間違いだったのかもしれない。

初めてデートをした日。
異常なまでに彼女は女性と話している僕を拒んだ。「浮気する気なの？」という彼女の眼は殺意すら感じた。

付き合いが長くなるのに比例し、彼女の精神はだんだんと不安定になっていった。
幻覚が見えているらしく、一人でどこかに行ったり、女性と話してもいないのに、「その女のほうが可愛いのか」「私をもう好きではないのか」と言ってくるようになった。
幻聴が聞こえているみたいに、言ってもないことに怒り、大したことないことでも喜怒哀楽が激しくなった。
耐えきれなくなった僕は、彼女には内緒でカウンセリングを依頼することにした。先生は顔立ちが良く、綺麗な女性だった。


先生によると、彼女は精神が不安定になりやすい体質で、少しのことでも気に病むよく言えば優しい心の持ち主。悪く言えば被害妄想が激しいのだろうということだった。
「薬で治療することもできるし、私が直接会って話をしてみることもできるけど、話を聞く限り私に会うことでさえ危険だと思う。」
「あなたから話を聞いて、私も少しでも彼女さんを支えられるように頑張ってみる。」
と非常に協力的で、僕の心の支えになっていた。


そして、半年前。



彼女は僕に言い放った。
「私妊娠したみたいなの。」
訳が分からなかった。彼女はピルを飲んでいて、さらに行為に及ぶ際は避妊もしていた。
でも、可能性は無きにしも非ず。病院に行くことになった。


しかし医者は妊娠はしていないと断言。でも彼女はまるで聞こえていないかのように、
「私たち親になるんだね」「これから頑張らないと。この子のためにも」
と言う始末。
その発言を聞いた医者は即座に精神科へ行くよう勧めてきた。
想像妊娠は少なくはないという。

だが、彼女は精神科に行くことを拒否した。
「お願いやめて！行きたくないの！私を殺さないで！」

そう言われ僕はどうすることもできなかった。

彼女が壊れていくのを僕は黙って見過ごすわけにはいかず、先生に会う回数を少しずつ増やしていくことにした。
「このままでは自殺してしまう可能性もあるから、できることなら一緒に暮らしてあげてほしい。」
その一言で、僕は彼女に同棲の話を持ち掛けた。
彼女は大喜びし、次の日には僕の家にいた。

最近の一週間ほどで、彼女は記憶でさえ正常でいられなくなった。
料理の味は次第に落ちていき、調味料の分量でさえまともに測れなくなった。
さらには家を荒すようになった。家具は倒れ、羽毛は床に降り注ぎ、服は破け散っている部屋をもう見たくなかった。

「このままではあなたの命さえ危ないかもしれない。今日家の様子を見せてほしい。そこで急いで対策を考えましょう。」
先生の顔は真っ青だった。


もし彼女が帰ってきたらこの状況をどう汲み取るのだろうか。仕事中なので大丈夫だとは思うが。
幸いにも仕事では現在のような症状はみられないとのことで安心している自分がいる。


先生が荒れている部屋を取っている最中に僕の人生は終わりを迎えた。

バタバタと音が聞こえる。
「違うんだ！落ち着いて！！！」

目の前に居る彼女は包丁を握っていた。
この状況下を僕はどうすれば良かったのだろうか。

「サヨナラ」
という声と共に彼女は走って行ってしまった。

この際、どうでもいい。
もし過去に戻れるなら、やり直したい、すべてを変えたい、誰か僕を止めてくれ。


彼女が楽しく笑っている姿のまま時を止めて。

気づいたら夜になっていた。銀のお皿は闇に包まれた独りだけの世界を唯一彩ってくれる。

息が詰まり、少し散歩することにした。

みぃみぃ。
どこからともなく声が聞こえる。
ああ、君も一人になってしまったんだね。僕と同じ、哀れだ。

お互い独りぼっちなら、同じ場所で時を過ごさないかい。

そう言い残し、子猫と僕は誰も待つことがない部屋へと足を運んだ。
`,
  },
  {
    author: 'Hirosuke',
    identifyText: '3作目',
    value: `そのねこは、いつのまにか目の前にいた。
まんまるのトパーズのような目、すらりと伸びたしっぽは、私を惹くのに十分だった。

てくてくと歩き出したねこにつられて、私の足も動き出す。
どこに行くのかな、行くところがあるのかな...。

茂みや狭い道を抜けた後、そこには小さな空き地があった。
まばらに点在するねこたち。不思議と見覚えがある。

「ねこ集会？」
ねこたちはこちらを向いた。何か言いたそう。

熱い視線か眩しい太陽か、なんだか目が眩んできた。
地面が傾いて、私は頭部を勢いよくぶつけてしまった。

...。

起きると、私は草むらの上で寝ていた。
猫はいなかった。どこに...？

探そうとしたとき、私は気付いた。
猫は自分だったことに。

まんまるのトパーズのような目、すらりと伸びたしっぽ、すべてが自分のものだったことに。
てくてくと歩き出した猫は自分で、...

え、自分が連れて行った人は...？
いや、私にとって人間は見慣れているものだ。きっと誰でもないに違いない。

車がちまちま通り、人はずかずかと歩いている。私は散歩している。
あの夢が変に印象に残っている。思い出しながら、歩いていた。

次の瞬間、私の目はたった一つの対象に目が釘付けになった。
私はそれを初めて見たのに。私はその姿を知らないはずなのに。

その人は、いつのまにか目の前にいた。`,
  },
]
